Cannot add the direction curve in the floor sketch.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FloorCannotAddDirectionCurve { get; }
  Visual Basic
Public Shared ReadOnly Property FloorCannotAddDirectionCurve As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FloorCannotAddDirectionCurve {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace